[
  {
    "id": "550e8400-e29b-41d4-a716-446655440001",
    "title": "My Journey into Linux and Docker",
    "slug": "my-journey-into-linux-and-docker",
    "date": "2024-09-26",
    "image": "",
    "summary": "Working in tech for half of my life and tinkering in tech for almost all of it, I've dabbled in a little bit of everything. Working in Help Desk and learning corporate IT to managing multiple systems as a Systems Admin up to oversight at an executive level. My knowledge is always expanding and I'm always trying to learn something new...",
    "content": "<p>Working in tech for half of my life and tinkering in tech for almost all of it, I've dabbled in a little bit of everything. Working in Help Desk and learning corporate IT to managing multiple systems as a Systems Admin up to oversight at an executive level. My knowledge is always expanding and I'm always trying to learn something new.</p><p>Over the last few years I've been heading down the path of Linux, more from a server side. I've always been a Windows guy as that is widely used both in business as well as residential. But Linux was something I didn't have as much exposure to and wasn't very well versed in. I knew some basic commands and could navigate the GUI of the basic distros, but I knew there was so much more.</p><p>I started my journey with a simple Raspberry Pi and Ubuntu Server. I tinkered with the Pi for basic projects like a game system emulator, a NAS to store some files and even a Plex server to steam my media library. I read article after article and followed guide after guide trying to learn as much as I could. I'd go down rabbit holes on some projects that would take me weeks of tinkering before I finally got it working just right.</p><p>Over time, I collected a few more PI's, until the shortage hit, and even took an old desktop and installed Linux on it. Slowly I was building my own little network of devices and some of them were even useful. I had to start labeling things with IP addresses and hostnames and draw a network diagram of everything so I could easily see what I had and how it was connected.</p><p>The more I dabbled, the more I added. Then I found out about Docker. Talk about a rabbit hole! That's been the path I've been on for the last year or so. I've containerized all the things and even recently migrated a bunch of containers from one server to another, and it actually went pretty well. I've added so many cool things to my infrastructure, PiHole for DNS, Wireguard for VPN, Duplicati and UrBackup for backups, WordPress for websites, Uptime Kuma to monitor everything and even a dashboard with Homepage so I can easily access everything.</p><p>Working with Docker I quickly learned how much easier it was to setup and recreate services using Docker Compose. That even led me into learning Git and setting up code repositories for all my different services to keep track of the projects and the changes I was making. This was honestly the hardest part for me as I'm simply terrible at documentation. But I've identified that weakness and I'm working on it.</p><p>I've learned so much in such a short time that I simply can't believe only a few years ago I was tinkering with a single Raspberry Pi in the basement. I've found so many great tech folks out there on YouTube sharing tons of great knowledge. <a href=\"https://www.jeffgeerling.com/\" class=\"text-brand-accent hover:underline\">Jeff Geerling</a>, <a href=\"https://technotim.live/\" class=\"text-brand-accent hover:underline\">Techno Tim</a>, <a href=\"https://networkchuck.com/\" class=\"text-brand-accent hover:underline\">Network Chuck</a>, and <a href=\"https://christianlempa.start.page/\" class=\"text-brand-accent hover:underline\">Christian Lempa</a> are just a few of the many out there. If you have any interest in learning anything tech related, do yourself a favor and give them a look. As I continue on my journey, I'm excited at the thought of all the other things I'm going to uncover and learn.</p>",
    "tags": [
      "Docker",
      "Linux",
      "Personal",
      "Projects"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440002",
    "title": "Time For A Digital Refresh",
    "slug": "time-for-a-digital-refresh",
    "date": "2022-01-06",
    "image": "",
    "summary": "A number of years ago, I purchased my own domain name, bjbeieronline.com. It was the first, but surely not the last. At the time I had no idea what I was going to do with it, but it was a big step in my digital life. I now had my own personalized spot on the internet...",
    "content": "<p>A number of years ago, I purchased my own domain name, bjbeieronline.com. It was the first, but surely not the last. At the time I had no idea what I was going to do with it, but it was a big step in my digital life. I now had my own personalized spot on the internet. Don't get me wrong, I've had a place in the internet for some time now with Facebook, Twitter, LinkedIn, and even the once ubiquitous MySpace (just Google it kids), but this was truly mine. I'm mean, it literally had my name on it.</p><p>After years of playing around with the free Google Apps (aka Google Workspace), and playing with things like Google Sites, I settled on using Blogger to post my content. After setting up a basic blog, I posted a couple times, but quickly got wrapped up in other things. I barely checked on the site, let alone posted any new content. For the next few years, the site was left in a bleak state with little attention or traffic.</p><p>In September 2011, something caused me to take notice of the domain and site again. On a whim, I searched again to see if bjbeier.com was available yet. It had been owned by someone in China and left parked when I had last searched years before. I was pleasantly surprised when my search showed it was not only available, but decently priced. I quickly scooped up and started planning my transition.</p><p>After moving to the new domain I thought I would try my hands at posting again, but just as before, quickly dropped off. The site again sat dormant until 2016 when I decided to use the site like a virtual resume. Nothing fancy, just some information about me and links to my other social platforms.</p><p>After a few months I moved back to Blogger and setup a static page using a free template I had come across. I was able to keep the same information, but give the site a nice responsive design with some animations. Once again I visited the idea of posting and made two professional/business themed posts in 2018. All the other parts had been personal about specifics in my life. I decided to go forward with content related to business or technology and keep personal stuff, well, personal.</p><p>Well, here we are at the beginning of 2022 and this will be the first post in nearly three years. I'm going to attempt once again to start posting more frequently, continuing to focus on the business and technical content. Over the last few years I've been getting more into Linux, playing with Raspberry Pi's, and building up my home network. My plan is to post as I'm going through some of the projects as well as posting general tips or tricks I've come across.</p><p>I recently refreshed the site with a new theme and moved from Blogger to WordPress. The static home page and blog now share the same theming and are no longer on separate sub domains. With WordPress being more popular than Blogger it made a huge difference in finding themes and plugins to fit my needs. So far I'm happy with the transition and excited to keep up the pace in posting!</p>",
    "tags": [
      "Blogging",
      "Personal",
      "Projects",
      "WordPress"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440003",
    "title": "Be Your Best Self - Show Your Best Self",
    "slug": "be-your-best-self-show-your-best-self",
    "date": "2018-12-01",
    "image": "",
    "summary": "This post is a follow up to \"Be Your Best Self - Tips For Any Employee\" that I wrote back in March 2018. I didn't write the post with the intention of doing a part two, but afterwards, I had a few items that came to mind and started jotting them down...",
    "content": "<p>This post is a follow up to \"<a href=\\\"be-your-best-self-tips-for-any-employee.html\\\" class=\\\"text-brand-accent hover:underline\\\">Be Your Best Self - Tips For Any Employee</a>\" that I wrote back in March 2018. I didn't write the post with the intention of doing a part two, but afterwards, I had a few items that came to mind and started jotting them down. Part one was centered around your current job or position and how to perform your best. But what if you're not happy in your current position or, for any number of reasons, you need to start looking for a new job?</p><p>No job is guaranteed. Ever. Budget cuts, outsourcing, and the economy are just a few reasons you might find yourself left out in the cold. It's not ideal, but sometimes companies simply need to let people go in order to keep the rest of the company running. In extreme circumstances, legal issues or sale of a company can yield undesirable results for employees. Know what's going on in your company, both internally as well as what's being reported publicly. If the rumor mill is churning, it might not be a bad idea to make sure you have everything in order, in case the rumors turn out to be true.</p><p>Plan ahead and be ready when the time arises. You should always have an up to date resume. We always seem to pull it out and dust if off when we decide to start looking for a job, but what if you don't get the luxury of a warning? At a minimum, make it an annual task that you perform. Doesn't matter when, new year, spring cleaning, national resume update month (no, really, it's September, look it up), just make sure you do it. Another time that may not seem as obvious, but is actually a great time is when you change positions/titles or get a promotion. This also helps so later on you don't have to dig back and try and figure out the correct dates.</p><p>So you've updated your resume and you're ready to start looking for a new job. Now what? Make sure you take a look at your social media profiles. If you don't want prospective employers or recruiters seeing the photos you posted 5 years ago of the party where you were doing a keg stand half naked, you should either lock down the privacy or start cleaning things up. Facebook, LinkedIn, and Twitter are common places that hiring managers and recruiters look at during the hiring process. Let them see only what you want them to see, nothing more. It also wouldn't hurt to have a professional looking profile photo on LinkedIn along with updated information.</p><p>If you want to really market yourself, you could start working on your personal brand. You could quickly and easily do this on LinkedIn. Like all other social media platforms, you can post quick messages, links, photos, etc. You can also now use LinkedIn Publishing that allows you to write article/blog style posts. To take things to another level, for less than $20 a year, you can purchase your own domain name and point it to a free or cheap website or blog. Use the website or blog as your canvas to share with the world. No matter which platform you chose, tell your story. No one knows you better than, well, you. Be descriptive, but be real. Don't try to oversell it.</p><p>One thing that hiring managers and recruiters love to see is training. Knowledge is power. Taking training or getting certified in a specific software or discipline can really help you stand out in the crowd. Many people think that you have to attend lengthy training or purchase expensive courses. The truth is, there are more free resources than you think. You just have to do some research. Cybrary.it and Edx.org are just two of the many that are available. One place that people have problems is following through. If you start a course, complete it. Also, if you have the chance, certify where you can. The certifications can help boost your credibility and might just be the one thing that sets you apart from another candidate.</p><p>Things don't always happen the way we expect, want or plan them to. You need to have a contingency plan in place if things do go south. Once you've started building your brand, keep it fresh. Add posts, articles, ideas, thoughts, suggestions, or whatever else to your LinkedIn, website or blog. Continue investing in yourself with training or certifications and follow through. The more you do, the more you'll better yourself. And when the time comes, you'll be ready to show your best self.</p>",
    "tags": [
      "Advice",
      "Employment",
      "Inspiration",
      "Personal"
    ]
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440004",
    "title": "Be Your Best Self - Tips For Any Employee",
    "slug": "be-your-best-self-tips-for-any-employee",
    "date": "2018-03-16",
    "image": "",
    "summary": "Whether you are fresh into a new position or a seasoned employee, there is always room for improvement. It has nothing to do with your performance or abilities in general, but simply that you can achieve so much more. You are in control of your work destiny, no one else...",
    "content": "<p>Whether you are fresh into a new position or a seasoned employee, there is always room for improvement. It has nothing to do with your performance or abilities in general, but simply that you can achieve so much more. You are in control of your work destiny, no one else. That raise you've been wanting, or that promotion you've had your eye on can be yours. You just have to work for it.</p><p>Managers and supervisors already have an enormous amount of work to do and the last thing they want to have to worry about is if their employees are getting things done. Learn to be self-sufficient. Don't sit around waiting for the next task or project to be assigned to you, go out and find it. If you come across something that you don't have time for right now, make note and go back to it when do you have extra time. Keeping your work flow at a constant pace helps keep you steady. If your work flow or tasks are erratic, that can affect your work style.</p><p>Staying busy is good, but don't over do it. If you already have five projects that you are juggling and your manager comes to you with something new, be honest. It is OK to tell your manager you have enough on your plate. If the new project is a higher priority, confirm with your manager that it is OK to put off one of the lower priority projects to make time. If you are overwhelmed, the quality of your work is sure to reflect it, which reflects poorly on you.</p><p>If you are juggling multiple tasks or projects, master the art of scheduling and prioritizing. If you have a handful of projects and one of them is significantly smaller or less involved, try knocking that project out first. Not only does this mark something off your to-do list, but it will boost your productivity by satisfying your sense of accomplishment. Likewise, if you have a large project with multiple tasks, start small and work your way up the list. Complete what you can and move on to the next task.</p><p>It happens to everyone. Mistakes. They are a part of life, but sometimes they are the best learning experiences. When you make a mistake doing something, you tend to remember that mistake, and ultimately, not make it again. Learn from your mistakes. Ask yourself, what could I have done to avoid the mistake. Also, own up to the mistake. Trying to ignore it or blame it on someone else ends up coming back to bite you. If you own up to it immediately, you can (hopefully) fix it, learn from it and move on to something else.</p><p>Earlier I mentioned getting a raise or promotion. Neither of these things are required or guaranteed in a position. They are rewards or incentives for a job well done. They are not given; they are earned. If you want a raise or promotion, you have to work for it. Don't work 9 to 5 every day doing only what has been asked of you. Come in a little early or stay a little late to get some work done on that big project that your manager has given to you. Being on time and reliable is one thing, but being available and dependable is another.</p><p>With all the hard work you've put in, it doesn't hurt to relax a little. Remember to take a break every now and then during the day. Get up, stretch your legs, get some coffee, whatever you need to do to give your mind a rest. Something as simple as walking down the hall and chatting with a coworker for a minute. Anything to stimulate your mind in a different way. If you're starting to feel burned out on a project, switch to something else. Sometimes powering through a project can do more harm than good.</p><p>A job is work, but it doesn't have to always feel that way. If you are passionate about what you do, and put your best self into it, great things will happen. If you put in the hard work and extra effort, there is no reason you shouldn't get that raise or promotion you've been working for.</p>",
    "tags": [
      "Advice",
      "Employment",
      "Inspiration",
      "Personal"
    ]
  }
]